Revit 2027 API
TessellatedShapeBuilderResult.GetIssuesForFaceSet Method
 Returns the array of issues encountered while processing a face set with index 'setIndex'.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<TessellatedBuildIssue> GetIssuesForFaceSet(
	int setIndex
)
Public Function GetIssuesForFaceSet (
	setIndex As Integer
) As IList(Of TessellatedBuildIssue)
public:
IList<TessellatedBuildIssue^>^ GetIssuesForFaceSet(
	int setIndex
)
member GetIssuesForFaceSet :
        setIndex : int -> IList<TessellatedBuildIssue>
Parameters
setIndex Int32
 Index of the face set.
Return Value
IList<TessellatedBuildIssue>
 Array of issues encountered while processing a face set with index 'setIndex'.
Exceptions
Exception | Condition
ArgumentException |  'SetIndex' is a valid face set index for the results stored in 'this'.
See Also
Reference
TessellatedShapeBuilderResult Class
Autodesk.Revit.DB Namespace